package lesson04;

public class PerimeterOfRectangle {


    /* Объявите две переменные для длин сторон прямоугольника.
    Написать код для вычисления периметра прямоугольника и выведите результат.
     */
    public static void main(String[] args) {

        int length = 4;
        int weight = 5;
        int out = (length * 2) + (weight * 2);
        System.out.println(out);


    }

}





