package lesson04;

public class Task02 {
   /* public static void main(String[]args){
        double tempFar=120;
        double tempCel=((tempFar-32)*5)/9;
        System.out.println("Far. "+tempFar);
        System.out.println("Cels " + tempCel);
        */


/*обьявить две переменные для длин сторон прямоугольника.
Написать код для вычисленния
периметра прямоугольника и вывести результат */
        public static void main(String[]args){
        /*
        int length=4;
        int weigt=5;
        int out= (length*2)+(weigt*2);
        System.out.println(out);

 String name="Olga ";
 String surname=" Siskowski";
 String result= name + surname;
 System.out.println(result);
 */



            /*расчитать общию продолжительность трех песен, если известна продолжительность каждой из них
            в секундах. Преобразуйте продолжительность каждой песни из секунды в минуты и секунды.

             */
            double lied1=130;
            double lied2=120;
            double lied3=240;
            System.out.println(lied1+lied2+lied3);

            System.out.println(lied1/60);
            System.out.println(lied2/60);
            System.out.println(lied3/60);

 }

 }





