package homework2;

public class Peremennaja {
    /*
     Задача: Напишите программу, в которой вы объявите переменные для хранения вашего возраста,
     имени и является ли сегодня выходным (логическое значение).
     Инициализируйте эти переменные соответствующими значениями.




    public static void main(String[] args) {
        String name = "Olga";
        int age = 48;
        boolean isWieckend = true ;
        System.out.println("My name is " + name + "," + "I'm " + age + " years old."+ " Today is Wieckend!");

            }

        }
*/


    /*
    Создайте три переменные: две целочисленные переменные с любыми значениями и одну переменную для результата.
    Выполните суммирование первых двух переменных и сохраните результат в третьей переменной.
    Выведите результат на экран.



    public static void main(String[] args) {
        int flowerRose = 15;
        int flowerCala = 5;
        int totalFlowers = flowerRose + flowerCala;
        System.out.println(" I have " + totalFlowers + " flowers in my garden.");
    }

}

*/



/*
Объявите две строковые переменные и инициализируйте их названием песни и названием альбома.
Создайте третью строковую переменную, которая будет содержать полную информацию,
путем конкатенации (сложения) первых двух переменных.
Выведите полную информацию на экран.
*/




    public static void main(String[] args) {
        String songName = "I Want to Break Free. ";
        String albumName = "Album: The Works. ";
        String infoAll= albumName + songName;
        System.out.println("I love listening to this song from " + infoAll);

    }
}


